print('ЧТО ТАКОЕ HTTP РЕЗУЛЬТАТ РАБОТЫ ПРОГРАММЫ')
# 1. БРАУЗЕР КЛИЕНТ---DomenNameSistem Server (Он преобразовывает запрос "яндексюру"
# в IP адрес нужной нам страницы Provides IP: 10.0.1.1
# 2. Именно по IP адресу ищется страница в интернете
# 3. Мы отправляем HTTP запрос на полученный IP адрес
# 4. Мы получаем ответ от сервера в виде HTML, CSS, JavaScript
# Также мы получаем статус код, который обозначает статус полученной страницы

# Запросы GET для запроса информации
# Запросы POST для отправки информации
